Catalogs/Договоры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>Договоры</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Контрагенты</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НомерДоговора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗаключенияДоговора</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокДействияДоговора</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Бессрочный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/Договоры/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаКлиенте
Процедура НомерДоговораПриИзменении(Элемент)
	ЗаполнитьНаименование();
КонецПроцедуры

&НаКлиенте
Процедура ДатаЗаключенияДоговораПриИзменении(Элемент)
	ЗаполнитьНаименование();
КонецПроцедуры

&НаКлиенте
Процедура БессрочныйПриИзменении(Элемент)
	ПризнакБезсрочногоДоговора()
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьНаименование()
	
	ДатаЗаключенияБезВремени = Формат(Объект.ДатаЗаключенияДоговора,"ДФ=дд.ММ.гггг");
	
	Если ЗначениеЗаполнено(Объект.НомерДоговора)
		И ЗначениеЗаполнено(Объект.ДатаЗаключенияДоговора) Тогда
		
		Объект.Наименование = "№ " + Объект.НомерДоговора + " от " + ДатаЗаключенияБезВремени + " г.";
		
	ИначеЕсли ЗначениеЗаполнено(Объект.НомерДоговора)
		И НЕ ЗначениеЗаполнено(Объект.ДатаЗаключенияДоговора) Тогда
		
		Объект.Наименование = "№ " + Объект.НомерДоговора; 
		
	ИначеЕсли НЕ ЗначениеЗаполнено(Объект.НомерДоговора)
		И ЗначениеЗаполнено(Объект.ДатаЗаключенияДоговора) Тогда 
		
		Объект.Наименование = " от " + ДатаЗаключенияБезВремени + " г.";
		
	КонецЕсли
	
	
КонецПроцедуры

&НаКлиенте
Процедура ПризнакБезсрочногоДоговора()
	
	Если Объект.Бессрочный = Истина Тогда 
		Элементы.СрокДействияДоговора.Видимость = Ложь;
		Объект.СрокДействияДоговора = Неопределено;
	Иначе
		Элементы.СрокДействияДоговора.Видимость = Истина;
	КонецЕсли
	
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ЗаполнитьНаименование();
	ПризнакБезсрочногоДоговора();
КонецПроцедуры
